model {
  faster_rcnn {
    num_classes: 3
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 600
        max_dimension: 1024
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_v2"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.00999999977648
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.699999988079
    first_stage_max_proposals: 100
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.800000011921
        iou_threshold: 0.200000023842
        max_detections_per_class: 30
        max_total_detections: 50
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.000199999994948
          schedule {
            step: 0
            learning_rate: 0.000199999994948
          }
          schedule {
            step: 900000
            learning_rate: 1.99999994948e-05
          }
          schedule {
            step: 1200000
            learning_rate: 1.99999999495e-06
          }
        }
      }
      momentum_optimizer_value: 0.899999976158
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/nobackup/shihav/Wind_test/checkpoints/inceptionV2/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 50000
}
train_input_reader {
  label_map_path: "/nobackup/shihav/Wind_test/data/clover_v3/label_map_clover.pbtxt"
  tf_record_input_reader {
    input_path: "/nobackup/shihav/Wind_test/data/clover_v3/clover.record"
  }
}
eval_config {
  num_examples: 200
  max_evals: 5
  use_moving_averages: false
  visualization_export_dir: "/nobackup/shihav/Wind_test/models/clover_v3/eval/Images"
}
eval_input_reader {
  label_map_path: "/nobackup/shihav/Wind_test/data/clover_v3/label_map_clover_eval.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/nobackup/shihav/Wind_test/data/clover_v3/clover_eval.record"
  }
}
